In [11]:
# import pandas as pd
import pandas as pd

# list of strings
lyst = ['CSC', '102', 'is', 'the', 'best','course', 'ever']

# Calling DataFrame constructor on list
df = pd.DataFrame(lyst)

# Print the output.
df

        0
0     CSC
1     102
2      is
3     the
4    best
5  course
6    ever

In [12]:
import pandas as pd

# initialise data of lists
data = {'Name': ['Angela', 'Precious', 'Luis', 'Ade'],
        'Age': [20, 21, 19, 18]}

# Create DataFrame
df = pd.DataFrame(data)

# Print the output
df

       Name  Age
0    Angela   20
1  Precious   21
2      Luis   19
3       Ade   18

In [13]:
# Import pandas package
import pandas as pd

# Define a dictionary containing employee data
data = {'Name': ['Clem', 'Prince', 'Edward', 'Adele'],
       'Age': [27, 24, 22, 32],
       'Address': ['Abuja', 'Kano', 'Minna', 'Lagos'],
       'Qualification': ['Msc', 'MA', 'MCA', 'Phd']}

# Convert the dictionary into DataFrame
df = pd.DataFrame(data)

# Select two columns
df[['Name', 'Qualification']]

     Name Qualification
0    Clem           Msc
1  Prince            MA
2  Edward           MCA
3   Adele           Phd

In [14]:
import pandas as pg

# Define a dictionary containing employee data
data = {'Name': ['Oyin', 'Mary', 'David', 'Bola'],
       'Age': [27, 24, 22, 32],
       'Address': ['Asaba', 'Maiduguri', 'Onitsha', 'Kwara'],
       'Qualification': ['Msc', 'MA', 'MCA', 'Phd']}

# Convert the dictionary into DataFrame
df = pd.DataFrame(data)

# Select first row
df.iloc[0]

Name              Oyin
Age                 27
Address          Asaba
Qualification      Msc
Name: 0, dtype: object

In [15]:
# Importing pandas package
import pandas as pd

# Making data frame form csv file
data = pd.read_csv("employee_records.csv")

# Print excel
data

    Employee Names  Years  Assesment Records  Points  Reward
0      Matthew Ade     25              125.3      21  438.55
1   Angela Adebisi     15               77.9      14  181.77
2  Calistus Ndukwe     10              144.2      18  432.60
3   Martha Martins      9               81.5      25  339.58
4    Victor Sayola     18               77.8      33  427.90
5      Adamu Bello     23               99.5      24  398.00

In [26]:
# Importing pandas package
import pandas as pd

# Making data frame from csv file
data = pd.read_csv("employee_records.csv")

df=data.iloc[1]

# Print excel
df

Employee Names       Angela Adebisi
Years                            15
Assesment Records              77.9
Points                           14
Reward                       181.77
Name: 1, dtype: object

In [23]:
# Importing pandas package
import pandas as pd

# Making data frame from csv file
data = pd.read_csv("employee_records.csv")

df=data.head(1)

# Print Excel
df

  Employee Names  Years  Assesment Records  Points  Reward
0    Matthew Ade     25              125.3      21  438.55

In [18]:
# Importing pandas as pd
import pandas as pd

# dictionary of lists
dict = {'name': ["Abdul", "Chukwuemeka", "Seyi", "Matt"],
       'degree': ["MBA", "BCA", "M.Tech", "MBA"],
       'score': [90, 40, 80, 98]}

# Creating a dataframe from a dictionary
df = pd.DataFrame(dict)

# Iterating over rows using iterrow() function
for i, j in df.iterrows():
    print(i, j)
    print()

0 name      Abdul
degree      MBA
score        90
Name: 0, dtype: object

1 name      Chukwuemeka
degree            BCA
score              40
Name: 1, dtype: object

2 name        Seyi
degree    M.Tech
score         80
Name: 2, dtype: object

3 name      Matt
degree     MBA
score       98
Name: 3, dtype: object

In [19]:
# Importing pandas as pd
import pandas as pd

# Dictionary of lists
dict = {'name': ["Bello", "Kamara", "Ugochi", "David"],
       'degree': ["MBA", "BCA", "M.Tech", "MBA"],
       'score': [90, 40, 80, 98]}

# Creating a dataframe form a dictionary
df = pd.DataFrame(dict)

# Creating a list of dataframe columns
columns = list(df)

for i in columns:
    
    # Printing the third element of the column
    print (df[i][2])

Ugochi
M.Tech
80

In [3]:
# Importing pandas as pd
import pandas as pd

# Dictionary of lists
records = {'name': ["Abel", "Kamsi", "Oyode", "Chinelo"],
          'degree': ["MBA", "BCA", "M.Tech", "MBA"],
          'score': [90, 40, 80, 98]}

# Creating a dataframe from a dictionary
df = pd.DataFrame(records)

# Saving the dataframe
df.to_csv('records.csv')